#! /bin/sh

case $1 in
  ascii)
    /bin/echo -e "\n\
 !ilI17 \e[1m!ilI17\e[0m AHH-eye-ell-Eye-one-seven
 co0ODQ \e[1mco0ODQ\e[0m see-oh-zero-Oh-Dee-Cue
 b6&B80 \e[1mb6&B80\e[0m bee-six-et-Bee-eight-zero
 sS5\$S  \e[1msS5\$S\e[0m  ess-Ess-five-dollar-Ess
 abcdefghijklmnopqrstuvwxyz @#$%^&
 \e[1mabcdefghijklmnopqrstuvwxyz @#$%^&\e[0m
 ABCDEFGHIJKLMNOPQRSTUVWXYZ ()[]{}
 \e[1mABCDEFGHIJKLMNOPQRSTUVWXYZ ()[]{}\e[0m
 0123456789 '\"\`~_-=+*\/|!?,.;:<>
 \e[1m0123456789 '\"\`~_-=+*\/|!?,.;:<>\e[0m\n"
    ;;

  lit)
    /bin/echo -e "\n\
 James Joyce « \e[4mFinnegan's Wake\e[0m »                     Παρμενίδης ὁ Ἐλεάτης « \e[4mἀλήθεια\e[0m »                    Фёдор Михайлович Достоевский « \e[4mИдіотъ\e[0m »

 \e[1m[1]\e[0m riverrun, past Eve and Adam's, from swerve of   \e[1m[2]\e[0m Εἰ δ' ἄγ' ἐγὼν ἐρέω, κόμισαι δὲ σὺ μῦθον ἀκούσ  \e[1m[1]\e[0m В конце ноября, в оттепель, часов в девять утр
 shore to bend of bay, brings us by a commodius vic  ας, αἵπερ ὁδοὶ μοῦναι διζήσιός εἰσι νοῆσαι· ἡ μὲν   а, поезд Петербургско-Варшавской железной дороги н
 us of recirculation back to Howth Castle and Envir  ὅπως ἔστιν τε καὶ ὡς οὐκ ἔστι μὴ εἶναι, Πειθοῦς ἐσ  а всех парах подходил к Петербургу. Было так сыро
 ons.                                                τι κέλευθος - Ἀληθείῃ γὰρ ὀπηδεῖ - , ἡ δ' ὡς οὐκ ἔ  и туманно, что насилу рассвело; в десяти шагах, вп
   Sir Tristram, violer d'amores, fr'over the short  στιν τε καὶ ὡς χρεών ἐστι μὴ εἶναι, τὴν δή τοι φρά  раво и влево от дороги, трудно было разглядеть хот
  sea, had passen-core rearrived from North Armoric  ζω παναπευθέα ἔμμεν ἀταρπόν· οὔτε γὰρ ἂν γνοίης τό  ь что-нибудь из окон вагона. Из пассажиров были и
 a on this side the scraggy isthmus of Europe Minor   γε μὴ ἐὸν - οὐ γὰρ ἀνυστόν - οὔτε φράσαις.         возвращавшиеся из-за границы; но более были наполн
  to wielderfight his penisolate war: nor had topsa  \e[1m[3]\e[0m ... τὸ γὰρ αὐτὸ νοεῖν ἐστίν τε καὶ εἶναι.       ены отделения для третьего класса, и все людом мел
 wyer's rocks by the stream Oconee exaggerated them  \e[1m[4]\e[0m Λεῦσσε δ' ὅμως ἀπεόντα νόῳ παρεόντα βεβαίως· ο  ким и деловым, не из очень далека. Все, как водитс
 selse to Laurens County's gorgios while they went   ὐ γὰρ ἀποτμήξει τὸ ἐὸν τοῦ ἐόντος ἔχεσθαι οὔτε σκι  я, устали, у всех отяжелели за ночь глаза, все наз
 doublin their mumper all the time: nor avoice from  δνάμενον πάντῃ πάντως κατὰ κόσμον οὔτε συνιστάμενο  яблись, все лица были бледно-желтые, под цвет тума
 afire bellowsed mishe mishe to tauftauf thuartpeat  ν.                                                  на.
 rick: not yet, though venissoon after, had a kidsc  \e[1m[5]\e[0m Ξυνὸν δὲ μοί ἐστιν, ὁππόθεν ἄρξωμαι· τόθι γὰρ     В одном из вагонов третьего класса, с рассвета,
 ad buttended a bland old isaac: not yet, though al  πάλιν ἵξομαι αὖθις.                                 очутились друг против друга, у самого окна, два па
 l's fair in vanessy, were sosie sesthers wroth wit  \e[1m[6]\e[0m Χρὴ τὸ λέγειν τε νοεῖν τ' ἐὸν ἔμμεναι· ἔστι γὰ  ссажира – оба люди молодые, оба почти налегке, оба
 h twone nathandjoe. Rot a peck of pa's malt had Jh  ρ εἶναι, μηδὲν δ' οὐκ ἔστιν· τά σ' ἐγὼ φράζεσθαι ἄ   не щегольски одетые, оба с довольно замечательным
 em or Shen brewed by arclight and rory end to the   νωγα. Πρώτης γάρ σ' ἀφ' ὁδοῦ ταύτης διζήσιος <εἴργ  и физиономиями и оба пожелавшие наконец войти друг
 regginbrow was to be seen ringsome on the aquaface  ω>, αὐτὰρ ἔπειτ' ἀπὸ τῆς, ἣν δὴ βροτοὶ εἰδότες οὐδ   с другом в разговор. Если б они оба знали один пр
 .                                                   ὲν πλάττονται, δίκρανοι· ἀμηχανίη γὰρ ἐν αὐτῶν στή  о другого, чем они особенно в эту минуту замечател
   The fall (bababadalgharaghtakamminarronnkonnbron  θεσιν ἰθύνει πλακτὸν νόον· οἱ δὲ φοροῦνται κωφοὶ ὁ  ьны, то, конечно, подивились бы, что случай так ст
 ntonner-ronntuonnthunntrovarrhounawnskawntoohoohoo  μῶς τυφλοί τε, τεθηπότες, ἄκριτα φῦλα, οἷς τὸ πέλε  ранно посадил их друг против друга в третьеклассно
 rdenenthur-nuk!) of a once wallstrait oldparr is r  ιν τε καὶ οὐκ εἶναι ταὐτὸν νενόμισται κοὐ ταὐτόν,   м вагоне петербургско-варшавского поезда. Один из
 etaled early in bed and later on life down through  πάντων δὲ παλίντροπός ἐστι κέλευθος.                них был небольшого роста, лет двадцати семи, курча
  all christian minstrelsy. The great fall of the o  \e[1m[7]\e[0m Οὐ γὰρ μήποτε τοῦτο δαμῇ εἶναι μὴ ἐόντα· ἀλλὰ   вый и почти черноволосый, с серыми маленькими, но
 ffwall entailed at such short notice the pftjschut  σὺ τῆσδ' ἀφ' ὁδοῦ διζήσιος εἶργε νόημα· μηδέ σ' ἔθ  огненными глазами. Нос его был широк и сплюснут, л
 e of Finnegan, erse solid man, that the humptyhill  ος πολύπειρον ὁδὸν κατὰ τήνδε βιάσθω, νωμᾶν ἄσκοπο  ицо скулистое; тонкие губы беспрерывно складывалис
 head of humself prumptly sends an unquiring one we  ν ὄμμα καὶ ἠχήεσσαν ἀκουήν καὶ γλῶσσαν, κρῖναι δὲ   ь в какую-то наглую, насмешливую и даже злую улыбк
 ll to the west in quest of his tumptytumtoes: and   λόγῳ πολύδηριν ἔλεγχον ἐξ ἐμέθεν ῥηθέντα.           у; но лоб его был высок и хорошо сформирован и скр\n"
    ;;

  unicode)
    /bin/echo -e "\n\
 ┌───┬───┐  ╷   ╻  ░░░░░░▄████▄      ┊╱▔▔▔▔▔▔▔▔╲┊┊┊┊┊        ⣠⣤⣴⣶⣶⣶⣦⣤⡀                      ⣠⣤⣶⣶⣶⣶⣤⣤⡀
 │┌─┐│┌─┐│ ╶┼╴ ╺╋╸ ░░░░░▐▌░░░░▐▌     ╱┈╱▔▆┈┈╱▔▆┈╲┊┊┊┊     ⣠⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⣄                 ⢀⣴⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⣦⡀
 ││0│││1││  ╵   ╹  ░░▄▀▀█▀░░░░▐▌     ▏▕┈┈▕┈▕┈┈▕┈▕┊┊┊┊   ⣠⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡆               ⢀⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣦⡀
 │└─┘│└─┘│ ┏┯┓ ┌┰┐ ░░▄░▐▄░░░░░▐▌▀▀▄  ▏┈▔▔▔┈┈▔▔▔┈▕┊┊┊┊ ⢀⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿               ⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⡀
 ├───┼───┤ ┠┼┨ ┝╋┥ ▐▀░▄▄░▀▌░▄▀▀░▀▄░▀ ▏▕▔▔▔▔▔▔▔▔▏▕┊┊┊┊ ⣼⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿               ⢻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿
 │┌─┐│┌─┐│ ┗┷┛ └┸┘ ▐░▀██▀░▌▐░▄██▄░▌  ╲┈╲┈┈╭━━╮╱┈╱┊┊┊┊ ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇ ⢀⣠⣤⣤⣶⣶⣶⣶⣶⣤⣤⣤⣀ ⠸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇
 ││2│││3││ ╭─╮     ░▀▄░▄▄▀░▐░░▀▀░░▌  ┊╲┈╰━┻━━╯┈╱┊┊┊┊┊ ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠖⠋⠉⠉ ⠉⠉⠻⣿⣿⠟⠉⠉⠉⠉⠉⠓⠿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇
 │└─┘│└─┘│ │ │     ░░░░█░░░░▀▄▄░▄▀   ┊┊▔▔▔▔▔▔▔▔       ⠹⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠋         ⠘⠃        ⠈⢻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠁
 └───┴───┘ ╰─╯     ░░░░█░█░░░░█░▐                      ⠉⠻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡟                       ⠙⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠟
                   ░░░░█░█░░░▐▌░█ ┌───────────────────┐  ⠈⠙⠛⠛⠛⠛⠛⠉⣱⣿⣿         ⣀⣀    ⣀⡀        ⢻⣿⣏⠛⠛⠛⠿⠛⠛⠛⠉
 ╔══╦══╗  ┌──┬──┐  ░░░░█░█░░░▐▌░█ │  ╔═══╗ Some Text  │▒        ⣴⣿⣿⣿        ⣾⣿⣿⡇  ⢸⣿⣿⣆       ⢸⣿⣿⣇
 ║┌─╨─┐║  │╔═╧═╗│  ░░░░▐▌▐▌░░░█░█ │  ╚═╦═╝ in the box │▒       ⢰⣿⣿⣿⣿       ⢰⣿⣿⣿⡇  ⣿⣿⣿⣿       ⣸⣿⣿⣿⡄
 ║│╲ ╱│║  │║   ║│  ░░░░▐▌░█▄░▐▌░█ ╞═╤══╩══╤═══════════╡▒       ⣼⣿⣿⣿⣿⡆      ⠘⣿⣿⣿⡇  ⣿⣿⣿⣿      ⢀⣿⣿⣿⣿⣿
 ╠╡ ╳ ╞╣  ├╢   ╟┤  ░░░░░█░░▀▀▀░░▐▌│ ├──┬──┤           │▒       ⣿⡿⠋⠉⠈⠉       ⠻⣿⣿⣃⣀⣀⣹⣿⣿⠃      ⠉⠁⠉⠉⢻⣿⡄
 ║│╱ ╲│║  │║   ║│  ░░░░░▐▌░░░░░░█ │ └──┴──┘           │▒       ⣿  ⢠         ⠒⠉⣉⣉⣍⣉⣉⠉⠛         ⡤  ⣿⠇
 ║└─╥─┘║  │╚═╤═╝│  ░░░░░░█▄░░░░▄█ └───────────────────┘▒       ⢻  ⠈⢣        ⢠⣿⣿⣿⣿⣿⣿⣿⡆        ⢠⠁  ⣿
 ╚══╩══╝  └──┴──┘  ░░░░░░░▀████▀   ▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒       ⠘⣆   ⢣⣀      ⠈⠻⠿⣿⣿⣿⡿⠿⠃      ⢀⣴⠃  ⢰⠋
                                                                ⠙⡄   ⠻⣦⣀                 ⢀⣠⡾⠁  ⢠⠏
 ▛▀▜ ▗▄▖ ░░▒▒▓▓██ ▁▂▃▄▅▆▇█  ┎┒┏┑ ╱╲╱╲╳╳╳ ┏┅┅┓ ┋ ┌┄┄┐ ╎ █         ⠘⢆   ⠙⣿⣷⣤⣄⡀          ⣀⣤⣴⣿⠿⠁  ⡴⠋
 ▙▄▟ ▝▀▘ ░░▒▒▓▓██           ┗╃╄┙ ╲╱╲╱╳╳╳ ╏  ┇ ┋ ┊  ┆ ╎ ▉          ⠈⠳⣄  ⠉⢿⣿⣿⣿⣶⣶⣶⣤⣤⣤⣶⣶⣶⣿⣿⣿⣿⠟  ⣀⠞⠁
 ╭──┬──╮  ╭──┬──╮  ┏━━┳━━┓  ┍╅╆┓ ╱╲╱╲╳╳╳ ╏  ┇ ┋ ┊  ┆ ╎ ▊            ⠈⠑⢦⡀⡀⠙⣿⢟⠉⠉⠉⠙⠻⡟⠉⠉⠙⠻⣿⠟⠁⡀⣤⠚⠁
 │╒═╪═╕│  │╓─╁─╖│  ┃┌─╂─┐┃  ┕┛┖┚ ╲╱╲╱╳╳╳ ┗╍╍┛ ┋ └╌╌┘ ╎ ▋               ⠈⠙⢦⡈⠑⠤⣂⣀⠄⠄⠄⣀⣐⠤⠒⢁⡤⠚⠉
 ││ │ ││  │║ ┃ ║│  ┃│ ╿ │┃    ┌───┬───┬───┬───┬───┐    ▌                  ⠈⠳⠤⣄⣈⡉⠉⠉⣀⣀⡤⠖⠃
 ├┼─┼─┼┤  ├╫─╂─╫┤  ┣┿╾┼╼┿┫    │┌─┐│┌─┐│┌─┐│┌─┐│┌─┐│    ▍                      ⠈⠉⠉⠉⠁
 ││ │ ││  │║ ┃ ║│  ┃│ ╽ │┃    ││0│││1│││2│││3│││4││    ▎
 │╘═╪═╛│  │╙─╀─╜│  ┃└─╂─┘┃    │└─┘│└─┘│└─┘│└─┘│└─┘│    ▏                       ▐
 ╰──┴──╯  ╰──┴──╯  ┗━━┻━━┛    └───┴───┴───┴───┴───┘                            █▌
                                          ⎧⎡⎛┌─────┐⎞⎤⎫                       ▐▌▜
   ∮ E⋅da = Q,  n → ∞, ∑ f(i) = ∏ g(i),   ⎪⎢⎜│a²+b³ ⎟⎥⎪         ▄             █▚▐▌
                                          ⎪⎢⎜│───── ⎟⎥⎪         ▝█▄          ▐█▐ █            ▟▘
   ∀x∈ℝ: ⌈x⌉ = −⌊−x⌋, α ∧ ¬β = ¬(¬α ∨ β), ⎪⎢⎜⎷ c₈   ⎟⎥⎪          ▜█▙▖        ▟█▝▌▟▙        ▗▟█▌
                                          ⎨⎢⎜       ⎟⎥⎬           ███▖       █▌▌▌▌█▌      ▗█▚█
   ℕ ⊆ ℕ₀ ⊂ ℤ ⊂ ℚ ⊂ ℝ ⊂ ℂ,                ⎪⎢⎜ ∞     ⎟⎥⎪ ▄▄        ▐▞█▜█▖    ▐█▙▌▌▘▜▙     ▄█▌▟▌       ▄▄▘
                                          ⎪⎢⎜ ⎲     ⎟⎥⎪  ▀█▛▙▄    ▝▙▀▛█▜▖   ▜█▐▚▌▌▖█▌  ▗▟▛▛▞█     ▄▛▜▚▘
   ⊥ < a ≠ b ≡ c ≤ d ≪ ⊤ ⇒ (⟦A⟧ ⇔ ⟪B⟫),   ⎪⎢⎜ ⎳aⁱ-bⁱ⎟⎥⎪   ▝█▄▀█▙▖  ▜▐▐▞▌▙▖ ▐██▐▗▌▘▘▜▙  ▟▛▞▞▗▛  ▗▗▛▛▞▄▘
                                          ⎩⎣⎝i=1    ⎠⎦⎭    ▝█▞▖▚▞▜▄▐▌▌▙▜▞█▙▐█▛█▐ ▘ ▟█▄▛▛▐▗▘▜▌▗▟▛▚▗▞▟▘
   2H₂ + O₂ ⇌ 2H₂O, R = 4.7 kΩ                               █▄▘ ▚▝█▙▜▟▌█▝▛██▌▙▐▘▘ ▗█▛▞▗▚▘▞███▀▄▚▚▞▌
                                                    ▀▄▄▄     ▝█▖ ▘▞▗█▐▌▙▝▙▐▞█▄▌█ ▌ ▚█▚▚▌▞▗▐█▚▘▞▖▚▘▟▘  ▗▄▟▟▀▘
                                                      ▀█▟▀▗▄▖ ▝▙▚   ▟▙▜▝▙▐▌▜▞█▌█▝ ▌█▚▀▞▗ ▘█▛▚▀▖▟▚▟▌▄▞▞▚▟▛
                                                        ▀██▄▀▜▄▄█▛▖ ▟█▐▙▜▖▜▖█▐█▛▐▗▚▌▞▐▗▌▖▐█▙▚▀▞▚▟▛▀▖▚▟█▘
                                                          ▀▙█▗▞▗▛▜▜█▄█▙▜▖█ ▚▝▌▜▛▐▐▛▐▗▌▞▗ ▜█▙▙█▟▀▘ ▙▜█▛
                                                            ▜██▚▖▘▞▗▀██▞█▝▙▝▙▐▖██▟▗▘▞▐▘▘▝▟██▛▘ ▖▄█▙█▘
                                                             ▝▙█▟▙▄▝▗ ▜█▟▙▐▙▝▌▜▞█▘▞▐▘▌▝ ▐█▛▘  ▄▛▙█▛▘
                                                               ▜▟▀▟▜▄▝ ██▜▙▐▙▜▖▙▛▐▗▘▞▗▘▗▟▛  ▄▛▜██▛
                                                                ▜█▟▀▟▛▙▖███▙▜▖▜▝▙▌▞▗▘▖ ▟▛ ▗▟▚▟██▀
                                                                 ▀██▄▀▟▞████▄▜▖▙▜▗▘▘▞ ▟▛▗▟▜▟▛▙█▘
                                                                   ▜██▚▟▀████▙▀▞█▙▟ ▗▟██▛▙█▚█▛▘
                                                                    ▝▀█▟▛▄█████████████▚█▜▟█▘
                                                                      ▝▀████▀▘     ▀▀█████▀
"
    ;;

  kuhn)
    /bin/echo -e "\n\
UTF-8 encoded sample plain-text file
‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾

Markus Kuhn [ˈmaʳkʊs kuːn] <mkuhn@acm.org> — 2002-07-25


The ASCII compatible UTF-8 encoding used in this plain-text file
is defined in Unicode, ISO 10646-1, and RFC 2279.


Using Unicode/UTF-8, you can write in emails and source code things such as

Mathematics and sciences:

  ∮ E⋅da = Q,  n → ∞, ∑ f(i) = ∏ g(i),      ⎧⎡⎛┌─────┐⎞⎤⎫
                                            ⎪⎢⎜│a²+b³ ⎟⎥⎪
  ∀x∈ℝ: ⌈x⌉ = −⌊−x⌋, α ∧ ¬β = ¬(¬α ∨ β),    ⎪⎢⎜│───── ⎟⎥⎪
                                            ⎪⎢⎜⎷ c₈   ⎟⎥⎪
  ℕ ⊆ ℕ₀ ⊂ ℤ ⊂ ℚ ⊂ ℝ ⊂ ℂ,                   ⎨⎢⎜       ⎟⎥⎬
                                            ⎪⎢⎜ ∞     ⎟⎥⎪
  ⊥ < a ≠ b ≡ c ≤ d ≪ ⊤ ⇒ (⟦A⟧ ⇔ ⟪B⟫),      ⎪⎢⎜ ⎲     ⎟⎥⎪
                                            ⎪⎢⎜ ⎳aⁱ-bⁱ⎟⎥⎪
  2H₂ + O₂ ⇌ 2H₂O, R = 4.7 kΩ, ⌀ 200 mm     ⎩⎣⎝i=1    ⎠⎦⎭

Linguistics and dictionaries:

  ði ıntəˈnæʃənəl fəˈnɛtık əsoʊsiˈeıʃn
  Y [ˈʏpsilɔn], Yen [jɛn], Yoga [ˈjoːgɑ]

APL:

  ((V⍳V)=⍳⍴V)/V←,V    ⌷←⍳→⍴∆∇⊃‾⍎⍕⌈

Nicer typography in plain text files:

  ╔══════════════════════════════════════════╗
  ║                                          ║
  ║   • ‘single’ and “double” quotes         ║
  ║                                          ║
  ║   • Curly apostrophes: “We’ve been here” ║
  ║                                          ║
  ║   • Latin-1 apostrophe and accents: '´\`  ║
  ║                                          ║
  ║   • ‚deutsche‘ „Anführungszeichen“       ║
  ║                                          ║
  ║   • †, ‡, ‰, •, 3–4, —, −5/+5, ™, …      ║
  ║                                          ║
  ║   • ASCII safety test: 1lI|, 0OD, 8B     ║
  ║                      ╭─────────╮         ║
  ║   • the euro symbol: │ 14.95 € │         ║
  ║                      ╰─────────╯         ║
  ╚══════════════════════════════════════════╝

Combining characters:

  STARGΛ̊TE SG-1, a = v̇ = r̈, a⃑ ⊥ b⃑

Greek (in Polytonic):

  The Greek anthem:

  Σὲ γνωρίζω ἀπὸ τὴν κόψη
  τοῦ σπαθιοῦ τὴν τρομερή,
  σὲ γνωρίζω ἀπὸ τὴν ὄψη
  ποὺ μὲ βία μετράει τὴ γῆ.

  ᾿Απ᾿ τὰ κόκκαλα βγαλμένη
  τῶν ῾Ελλήνων τὰ ἱερά
  καὶ σὰν πρῶτα ἀνδρειωμένη
  χαῖρε, ὦ χαῖρε, ᾿Ελευθεριά!

  From a speech of Demosthenes in the 4th century BC:

  Οὐχὶ ταὐτὰ παρίσταταί μοι γιγνώσκειν, ὦ ἄνδρες ᾿Αθηναῖοι,
  ὅταν τ᾿ εἰς τὰ πράγματα ἀποβλέψω καὶ ὅταν πρὸς τοὺς
  λόγους οὓς ἀκούω· τοὺς μὲν γὰρ λόγους περὶ τοῦ
  τιμωρήσασθαι Φίλιππον ὁρῶ γιγνομένους, τὰ δὲ πράγματ᾿ 
  εἰς τοῦτο προήκοντα,  ὥσθ᾿ ὅπως μὴ πεισόμεθ᾿ αὐτοὶ
  πρότερον κακῶς σκέψασθαι δέον. οὐδέν οὖν ἄλλο μοι δοκοῦσιν
  οἱ τὰ τοιαῦτα λέγοντες ἢ τὴν ὑπόθεσιν, περὶ ἧς βουλεύεσθαι,
  οὐχὶ τὴν οὖσαν παριστάντες ὑμῖν ἁμαρτάνειν. ἐγὼ δέ, ὅτι μέν
  ποτ᾿ ἐξῆν τῇ πόλει καὶ τὰ αὑτῆς ἔχειν ἀσφαλῶς καὶ Φίλιππον
  τιμωρήσασθαι, καὶ μάλ᾿ ἀκριβῶς οἶδα· ἐπ᾿ ἐμοῦ γάρ, οὐ πάλαι
  γέγονεν ταῦτ᾿ ἀμφότερα· νῦν μέντοι πέπεισμαι τοῦθ᾿ ἱκανὸν
  προλαβεῖν ἡμῖν εἶναι τὴν πρώτην, ὅπως τοὺς συμμάχους
  σώσομεν. ἐὰν γὰρ τοῦτο βεβαίως ὑπάρξῃ, τότε καὶ περὶ τοῦ
  τίνα τιμωρήσεταί τις καὶ ὃν τρόπον ἐξέσται σκοπεῖν· πρὶν δὲ
  τὴν ἀρχὴν ὀρθῶς ὑποθέσθαι, μάταιον ἡγοῦμαι περὶ τῆς
  τελευτῆς ὁντινοῦν ποιεῖσθαι λόγον.

  Δημοσθένους, Γ´ ᾿Ολυνθιακὸς

Georgian:

  From a Unicode conference invitation:

  გთხოვთ ახლავე გაიაროთ რეგისტრაცია Unicode-ის მეათე საერთაშორისო
  კონფერენციაზე დასასწრებად, რომელიც გაიმართება 10-12 მარტს,
  ქ. მაინცში, გერმანიაში. კონფერენცია შეჰკრებს ერთად მსოფლიოს
  ექსპერტებს ისეთ დარგებში როგორიცაა ინტერნეტი და Unicode-ი,
  ინტერნაციონალიზაცია და ლოკალიზაცია, Unicode-ის გამოყენება
  ოპერაციულ სისტემებსა, და გამოყენებით პროგრამებში, შრიფტებში,
  ტექსტების დამუშავებასა და მრავალენოვან კომპიუტერულ სისტემებში.

Russian:

  From a Unicode conference invitation:

  Зарегистрируйтесь сейчас на Десятую Международную Конференцию по
  Unicode, которая состоится 10-12 марта 1997 года в Майнце в Германии.
  Конференция соберет широкий круг экспертов по  вопросам глобального
  Интернета и Unicode, локализации и интернационализации, воплощению и
  применению Unicode в различных операционных системах и программных
  приложениях, шрифтах, верстке и многоязычных компьютерных системах.

Thai (UCS Level 2):

  Excerpt from a poetry on The Romance of The Three Kingdoms (a Chinese
  classic 'San Gua'):

  [----------------------------|------------------------]
    ๏ แผ่นดินฮั่นเสื่อมโทรมแสนสังเวช  พระปกเกศกองบู๊กู้ขึ้นใหม่
  สิบสองกษัตริย์ก่อนหน้าแลถัดไป       สององค์ไซร้โง่เขลาเบาปัญญา
    ทรงนับถือขันทีเป็นที่พึ่ง           บ้านเมืองจึงวิปริตเป็นนักหนา
  โฮจิ๋นเรียกทัพทั่วหัวเมืองมา         หมายจะฆ่ามดชั่วตัวสำคัญ
    เหมือนขับไสไล่เสือจากเคหา      รับหมาป่าเข้ามาเลยอาสัญ
  ฝ่ายอ้องอุ้นยุแยกให้แตกกัน          ใช้สาวนั้นเป็นชนวนชื่นชวนใจ
    พลันลิฉุยกุยกีกลับก่อเหตุ          ช่างอาเพศจริงหนาฟ้าร้องไห้
  ต้องรบราฆ่าฟันจนบรรลัย           ฤๅหาใครค้ำชูกู้บรรลังก์ ฯ

  (The above is a two-column text. If combining characters are handled
  correctly, the lines of the second column should be aligned with the
  | character above.)

Ethiopian:

  Proverbs in the Amharic language:

  ሰማይ አይታረስ ንጉሥ አይከሰስ።
  ብላ ካለኝ እንደአባቴ በቆመጠኝ።
  ጌጥ ያለቤቱ ቁምጥና ነው።
  ደሀ በሕልሙ ቅቤ ባይጠጣ ንጣት በገደለው።
  የአፍ ወለምታ በቅቤ አይታሽም።
  አይጥ በበላ ዳዋ ተመታ።
  ሲተረጉሙ ይደረግሙ።
  ቀስ በቀስ፥ ዕንቁላል በእግሩ ይሄዳል።
  ድር ቢያብር አንበሳ ያስር።
  ሰው እንደቤቱ እንጅ እንደ ጉረቤቱ አይተዳደርም።
  እግዜር የከፈተውን ጉሮሮ ሳይዘጋው አይድርም።
  የጎረቤት ሌባ፥ ቢያዩት ይስቅ ባያዩት ያጠልቅ።
  ሥራ ከመፍታት ልጄን ላፋታት።
  ዓባይ ማደሪያ የለው፥ ግንድ ይዞ ይዞራል።
  የእስላም አገሩ መካ የአሞራ አገሩ ዋርካ።
  ተንጋሎ ቢተፉ ተመልሶ ባፉ።
  ወዳጅህ ማር ቢሆን ጨርስህ አትላሰው።
  እግርህን በፍራሽህ ልክ ዘርጋ።

Runes:

  ᚻᛖ ᚳᚹᚫᚦ ᚦᚫᛏ ᚻᛖ ᛒᚢᛞᛖ ᚩᚾ ᚦᚫᛗ ᛚᚪᚾᛞᛖ ᚾᚩᚱᚦᚹᛖᚪᚱᛞᚢᛗ ᚹᛁᚦ ᚦᚪ ᚹᛖᛥᚫ

  (Old English, which transcribed into Latin reads 'He cwaeth that he
  bude thaem lande northweardum with tha Westsae.' and means 'He said
  that he lived in the northern land near the Western Sea.')

Braille:

  ⡌⠁⠧⠑ ⠼⠁⠒  ⡍⠜⠇⠑⠹⠰⠎ ⡣⠕⠌

  ⡍⠜⠇⠑⠹ ⠺⠁⠎ ⠙⠑⠁⠙⠒ ⠞⠕ ⠃⠑⠛⠔ ⠺⠊⠹⠲ ⡹⠻⠑ ⠊⠎ ⠝⠕ ⠙⠳⠃⠞
  ⠱⠁⠞⠑⠧⠻ ⠁⠃⠳⠞ ⠹⠁⠞⠲ ⡹⠑ ⠗⠑⠛⠊⠌⠻ ⠕⠋ ⠙⠊⠎ ⠃⠥⠗⠊⠁⠇ ⠺⠁⠎
  ⠎⠊⠛⠝⠫ ⠃⠹ ⠹⠑ ⠊⠇⠻⠛⠹⠍⠁⠝⠂ ⠹⠑ ⠊⠇⠻⠅⠂ ⠹⠑ ⠥⠝⠙⠻⠞⠁⠅⠻⠂
  ⠁⠝⠙ ⠹⠑ ⠡⠊⠑⠋ ⠍⠳⠗⠝⠻⠲ ⡎⠊⠗⠕⠕⠛⠑ ⠎⠊⠛⠝⠫ ⠊⠞⠲ ⡁⠝⠙
  ⡎⠊⠗⠕⠕⠛⠑⠰⠎ ⠝⠁⠍⠑ ⠺⠁⠎ ⠛⠕⠕⠙ ⠥⠏⠕⠝ ⠰⡡⠁⠝⠛⠑⠂ ⠋⠕⠗ ⠁⠝⠹⠹⠔⠛ ⠙⠑
  ⠡⠕⠎⠑ ⠞⠕ ⠏⠥⠞ ⠙⠊⠎ ⠙⠁⠝⠙ ⠞⠕⠲

  ⡕⠇⠙ ⡍⠜⠇⠑⠹ ⠺⠁⠎ ⠁⠎ ⠙⠑⠁⠙ ⠁⠎ ⠁ ⠙⠕⠕⠗⠤⠝⠁⠊⠇⠲

  ⡍⠔⠙⠖ ⡊ ⠙⠕⠝⠰⠞ ⠍⠑⠁⠝ ⠞⠕ ⠎⠁⠹ ⠹⠁⠞ ⡊ ⠅⠝⠪⠂ ⠕⠋ ⠍⠹
  ⠪⠝ ⠅⠝⠪⠇⠫⠛⠑⠂ ⠱⠁⠞ ⠹⠻⠑ ⠊⠎ ⠏⠜⠞⠊⠊⠥⠇⠜⠇⠹ ⠙⠑⠁⠙ ⠁⠃⠳⠞
  ⠁ ⠙⠕⠕⠗⠤⠝⠁⠊⠇⠲ ⡊ ⠍⠊⠣⠞ ⠙⠁⠧⠑ ⠃⠑⠲ ⠔⠊⠇⠔⠫⠂ ⠍⠹⠎⠑⠇⠋⠂ ⠞⠕
  ⠗⠑⠛⠜⠙ ⠁ ⠊⠕⠋⠋⠔⠤⠝⠁⠊⠇ ⠁⠎ ⠹⠑ ⠙⠑⠁⠙⠑⠌ ⠏⠊⠑⠊⠑ ⠕⠋ ⠊⠗⠕⠝⠍⠕⠝⠛⠻⠹
  ⠔ ⠹⠑ ⠞⠗⠁⠙⠑⠲ ⡃⠥⠞ ⠹⠑ ⠺⠊⠎⠙⠕⠍ ⠕⠋ ⠳⠗ ⠁⠝⠊⠑⠌⠕⠗⠎
  ⠊⠎ ⠔ ⠹⠑ ⠎⠊⠍⠊⠇⠑⠆ ⠁⠝⠙ ⠍⠹ ⠥⠝⠙⠁⠇⠇⠪⠫ ⠙⠁⠝⠙⠎
  ⠩⠁⠇⠇ ⠝⠕⠞ ⠙⠊⠌⠥⠗⠃ ⠊⠞⠂ ⠕⠗ ⠹⠑ ⡊⠳⠝⠞⠗⠹⠰⠎ ⠙⠕⠝⠑ ⠋⠕⠗⠲ ⡹⠳
  ⠺⠊⠇⠇ ⠹⠻⠑⠋⠕⠗⠑ ⠏⠻⠍⠊⠞ ⠍⠑ ⠞⠕ ⠗⠑⠏⠑⠁⠞⠂ ⠑⠍⠏⠙⠁⠞⠊⠊⠁⠇⠇⠹⠂ ⠹⠁⠞
  ⡍⠜⠇⠑⠹ ⠺⠁⠎ ⠁⠎ ⠙⠑⠁⠙ ⠁⠎ ⠁ ⠙⠕⠕⠗⠤⠝⠁⠊⠇⠲

  (The first couple of paragraphs of \"A Christmas Carol\" by Dickens)

Compact font selection example text:

  ABCDEFGHIJKLMNOPQRSTUVWXYZ /0123456789
  abcdefghijklmnopqrstuvwxyz £©µÀÆÖÞßéöÿ
  –—‘“”„†•…‰™œŠŸž€ ΑΒΓΔΩαβγδω АБВГДабвгд
  ∀∂∈ℝ∧∪≡∞ ↑↗↨↻⇣ ┐┼╔╘░►☺♀ ﬁ?⑀₂ἠḂӥẄɐː⍎אԱა

Greetings in various languages:

  Hello world, Καλημέρα κόσμε, コンニチハ

Box drawing alignment tests:                                          █
                                                                      ▉
  ╔══╦══╗  ┌──┬──┐  ╭──┬──╮  ╭──┬──╮  ┏━━┳━━┓  ┎┒┏┑   ╷  ╻ ┏┯┓ ┌┰┐    ▊ ╱╲╱╲╳╳╳
  ║┌─╨─┐║  │╔═╧═╗│  │╒═╪═╕│  │╓─╁─╖│  ┃┌─╂─┐┃  ┗╃╄┙  ╶┼╴╺╋╸┠┼┨ ┝╋┥    ▋ ╲╱╲╱╳╳╳
  ║│╲ ╱│║  │║   ║│  ││ │ ││  │║ ┃ ║│  ┃│ ╿ │┃  ┍╅╆┓   ╵  ╹ ┗┷┛ └┸┘    ▌ ╱╲╱╲╳╳╳
  ╠╡ ╳ ╞╣  ├╢   ╟┤  ├┼─┼─┼┤  ├╫─╂─╫┤  ┣┿╾┼╼┿┫  ┕┛┖┚     ┌┄┄┐ ╎ ┏┅┅┓ ┋ ▍ ╲╱╲╱╳╳╳
  ║│╱ ╲│║  │║   ║│  ││ │ ││  │║ ┃ ║│  ┃│ ╽ │┃  ░░▒▒▓▓██ ┊  ┆ ╎ ╏  ┇ ┋ ▎
  ║└─╥─┘║  │╚═╤═╝│  │╘═╪═╛│  │╙─╀─╜│  ┃└─╂─┘┃  ░░▒▒▓▓██ ┊  ┆ ╎ ╏  ┇ ┋ ▏
  ╚══╩══╝  └──┴──┘  ╰──┴──╯  ╰──┴──╯  ┗━━┻━━┛  ▗▄▖▛▀▜   └╌╌┘ ╎ ┗╍╍┛ ┋  ▁▂▃▄▅▆▇█
                                               ▝▀▘▙▄▟
"
    ;;

  *)
    echo "usage: $(basename $0) (ascii|kuhn|lit|unicode)"
    ;;
esac
